import { ICatcherKitStorage } from './types';

const catcherKitStorage: ICatcherKitStorage[] = [
    {
        types: [ 'start', 'hello' ],
        stickers: [
            12467, 14085, 15346, 14988, 14409, 13905, 7387, 6864,
            5785, 8472, 8481, 11711, 7256, 13833, 13650, 13483,
            13486, 13361, 12814, 12548, 12549, 12395, 12115, 11990,
            10575, 10027, 9755, 9549, 9411, 8807, 15298, 8748, 14550,
            14538, 14510, 15415, 15182, 11238, 15472, 11607,
            21, 134, 134, 5990, 3003, 4639, 4917, 5129, 
        ],
        phrases: [
            '&#128075;', 'bonjour', 'ghbdtn', 'hello', 'hey', 'hi',
            'konichiwa', 'sup', 'y0', 'yo', 'алоха', 'бззздарова',
            'бонжур', 'дароу', 'дороу', 'здарова', 'здравствуйте',
            'здрасте', 'здрасьте', 'коничива', 'кчао', 'ну здрасьте',
            'привет-привет', 'приветик', 'приветики', 'приветствую',
            'приветули', 'привки', 'привяу', 'прифф', 'приффки', 'прювет',
            'салют', 'хай', 'хаю хай', 'хей', 'хелло', 'хеллоу', 'хэй', 'хэллоу',
            'ку', 'ку ку', 'старт', 'стартуем', 'стартуй',
        ]
    },
    {
        types: [ 'go', 'drove' ],
        stickers: [
            14468, 13947, 14207, 12944, 13507, 10562, 12784, 11704, 12063,
            6244, 15355, 13972, 15690, 9769, 6217, 4676, 3677, 2920,
        ],
        phrases: [
            'гоу', 'го', 'го го го', 'гоу гоу гоу', 'погнали', 'поехали',
        ]
    },
    {
        types: [ 'yes', 'true' ],
        stickers: [
            15161, 15591, 14677, 15497, 11635, 15403, 6353, 6334,
            15057, 14950, 12828, 11991, 8035, 14258, 6229,
        ],
        phrases: [
            '&#128075;', 'bonjour', 'ghbdtn', 'hello', 'hey', 'hi',
            'konichiwa', 'sup', 'y0', 'yo', 'алоха', 'бззздарова',
            'бонжур', 'дароу', 'дороу', 'здарова', 'здравствуйте',
            'здрасте', 'здрасьте', 'коничива', 'кчао', 'ну здрасьте',
            'привет-привет', 'приветик', 'приветики', 'приветствую',
            'приветули', 'привки', 'привяу', 'прифф', 'приффки', 'прювет',
            'салют', 'хай', 'хаю хай', 'хей', 'хелло', 'хеллоу', 'хэй', 'хэллоу',
        ]
    },
    {
        types: [ 'no', 'false' ],
        stickers: [
            6894, 14418, 6892, 7273, 12969, 12911, 12475, 12499,
            14257, 14262, 2794, 12402, 11992, 10580, 10454, 8443,
            8036, 6232, 4337, 150, 35, 12828, 11635,
        ],
        phrases: [
            'нет', 'согл', 'согласен',
        ]
    },
    {
        types: [ 'cancel', 'close' ],
        stickers: [
            6346, 11228, 7578, 9651,
        ],
        phrases: [
            'не хочу', 'нихатю',
        ]
    },
    {
        types: [ 'help' ],
        stickers: [
            15610, 13171, 14497, 10427, 13311, 8954, 12446,
            12960, 14362, 14029, 12820, 10225,
        ],
        phrases: [
            'help', 'sos', 'мне нуфна помофь', 'можешь мне помочь',
            'на помощь', 'нужна помощь', 'помоги', 'помоги мне',
            'спасите', 'спасите помогите', 'мне нужна помощь',
            'хелп', 'хелп ми',
        ]
    },
];

export default catcherKitStorage;
